export const state = (): any => ({
  projects: [
    {
      id: 1,
      title:
        '給食の献立をオンライン化！\n4919プロジェクトを一緒に全国展開するエンジニアの方を探しています',
      image: '/image/project_sample.jpg',
      auther: '河中祥吾',
      tags: ['食', '奈良', 'エンジニア'],
      endsOn: '6/30',
      detail: {
        overview:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。本当は、文字を入れた感じを試すためにやっているというのが目的というのもわかります。でも、それでも、皆さんに感動を与えたいと僕は思っているんです。本当です。本当なんです。絶対に皆さんが感動し、涙を流すまで文章を書き続けることを、僕はここに強く誓います。天は人の上に人を作らず。全ての人は平等だと僕は思い続けて、この文章を書いているのです。心の中の邪念を洗い流すのです。今です。今こそその時です。やりましょう。今です。今だ。',
        terms:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。本当は、文字を入れた感じを試すためにやっているというのが目的というのもわかります。でも、それでも、皆さんに感動を与えたいと僕は思っているんです。本当です。本当なんです。絶対に皆さんが感動し、涙を流すまで文章を書き続けることを、僕はここに強く誓います。天は人の上に人を作らず。全ての人は平等だと僕は思い続けて、この文章を書いているのです。心の中の邪念を洗い流すのです。今です。今こそその時です。やりましょう。今です。今だ。',
        issues:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。本当は、文字を入れた感じを試すためにやっているというのが目的というのもわかります。でも、それでも、皆さんに感動を与えたいと僕は思っているんです。本当です。本当なんです。絶対に皆さんが感動し、涙を流すまで文章を書き続けることを、僕はここに強く誓います。天は人の上に人を作らず。全ての人は平等だと僕は思い続けて、この文章を書いているのです。心の中の邪念を洗い流すのです。今です。今こそその時です。やりましょう。今です。今だ。',
        wishes:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。本当は、文字を入れた感じを試すためにやっているというのが目的というのもわかります。でも、それでも、皆さんに感動を与えたいと僕は思っているんです。本当です。本当なんです。絶対に皆さんが感動し、涙を流すまで文章を書き続けることを、僕はここに強く誓います。天は人の上に人を作らず。全ての人は平等だと僕は思い続けて、この文章を書いているのです。心の中の邪念を洗い流すのです。今です。今こそその時です。やりましょう。今です。今だ。',
      },
      requirements: {
        personality:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。',
        number: 2,
        benefits:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。',
        rewards:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。',
        duration:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。',
        procedures:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。',
      },
    },
    {
      id: 2,
      title:
        '222給食の献立をオンライン化！\n4919プロジェクトを一緒に全国展開するエンジニアの方を探しています',
      image: '/image/project_sample.jpg',
      auther: '河中祥吾',
      tags: ['食', '奈良', 'エンジニア'],
      endsOn: '6/30',
      detail: {
        overview:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。本当は、文字を入れた感じを試すためにやっているというのが目的というのもわかります。でも、それでも、皆さんに感動を与えたいと僕は思っているんです。本当です。本当なんです。絶対に皆さんが感動し、涙を流すまで文章を書き続けることを、僕はここに強く誓います。天は人の上に人を作らず。全ての人は平等だと僕は思い続けて、この文章を書いているのです。心の中の邪念を洗い流すのです。今です。今こそその時です。やりましょう。今です。今だ。',
        terms:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。本当は、文字を入れた感じを試すためにやっているというのが目的というのもわかります。でも、それでも、皆さんに感動を与えたいと僕は思っているんです。本当です。本当なんです。絶対に皆さんが感動し、涙を流すまで文章を書き続けることを、僕はここに強く誓います。天は人の上に人を作らず。全ての人は平等だと僕は思い続けて、この文章を書いているのです。心の中の邪念を洗い流すのです。今です。今こそその時です。やりましょう。今です。今だ。',
        issues:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。本当は、文字を入れた感じを試すためにやっているというのが目的というのもわかります。でも、それでも、皆さんに感動を与えたいと僕は思っているんです。本当です。本当なんです。絶対に皆さんが感動し、涙を流すまで文章を書き続けることを、僕はここに強く誓います。天は人の上に人を作らず。全ての人は平等だと僕は思い続けて、この文章を書いているのです。心の中の邪念を洗い流すのです。今です。今こそその時です。やりましょう。今です。今だ。',
        wishes:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。本当は、文字を入れた感じを試すためにやっているというのが目的というのもわかります。でも、それでも、皆さんに感動を与えたいと僕は思っているんです。本当です。本当なんです。絶対に皆さんが感動し、涙を流すまで文章を書き続けることを、僕はここに強く誓います。天は人の上に人を作らず。全ての人は平等だと僕は思い続けて、この文章を書いているのです。心の中の邪念を洗い流すのです。今です。今こそその時です。やりましょう。今です。今だ。',
      },
      requirements: {
        personality:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。',
        number: 2,
        benefits:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。',
        rewards:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。',
        duration:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。',
        procedures:
          'この文章はダミーですが、それでも皆さんに感動を与えたいと思い、想いを込めて記入しています。',
      },
    },
  ],
})

export const getters = {
  getProjectById: state => id => {
    return state.projects.find(project => project.id === id)
  },
}

export const mutations = {
  setPeople(state, people) {
    state.people = people
  },
}

export const actions = {
  // async nuxtServerInit({ commit }, { app }) {
  //   const people = await app.$axios.$get('./random-data.json')
  //   commit('setPeople', people.slice(0, 10))
  // },
}
